released/STM32L152_Cube_FW_L1_V1.8.0_UART/Projects/STM32L152RE-Nucleo/Templates/Inc/main.h
/**
  ******************************************************************************
  * @file    Templates/Inc/main.h 
  * @author  MCD Application Team
  * @brief   Header for main.c module
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2017 STMicroelectronics</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

/* Includes ------------------------------------------------------------------*/
#include "stm32l1xx_hal.h"
//#include "stm32l1xx_nucleo.h"
//#include "stm32_adafruit_sd.h"
//#include "stm32_adafruit_lcd.h"
/* Exported types ------------------------------------------------------------*/
//#define UART_TX_POLLING_RX_IT
#define UART_DMA

#define UARTx                           		USART2
#define UARTx_CLK_ENABLE()              	__HAL_RCC_USART2_CLK_ENABLE();
#define UARTx_RX_GPIO_CLK_ENABLE()      	__HAL_RCC_GPIOA_CLK_ENABLE()
#define UARTx_TX_GPIO_CLK_ENABLE()      	__HAL_RCC_GPIOA_CLK_ENABLE() 

#define UARTx_FORCE_RESET()             	__HAL_RCC_USART2_FORCE_RESET()
#define UARTx_RELEASE_RESET()           	__HAL_RCC_USART2_RELEASE_RESET()

/* Definition for UARTx Pins */
#define UARTx_TX_PIN                    		GPIO_PIN_2
#define UARTx_TX_GPIO_PORT              	GPIOA  
#define UARTx_TX_AF                     		GPIO_AF7_USART2
#define UARTx_RX_PIN                    		GPIO_PIN_3
#define UARTx_RX_GPIO_PORT              	GPIOA 
#define UARTx_RX_AF                     	GPIO_AF7_USART2

#define DMAx_CLK_ENABLE()                	__HAL_RCC_DMA1_CLK_ENABLE()
#define USARTx_TX_DMA_CHANNEL            	DMA1_Channel7
#define USARTx_RX_DMA_CHANNEL            	DMA1_Channel6

/* Definition for UARTx's NVIC */
#define UARTx_TX_DMA_IRQn               	DMA1_Channel7_IRQn
#define UARTx_RX_DMA_IRQn               	DMA1_Channel6_IRQn
#define UARTx_TX_DMA_IRQHandler         	DMA1_Channel7_IRQHandler
#define UARTx_RX_DMA_IRQHandler         	DMA1_Channel6_IRQHandler

#define UARTx_IRQn                      		USART2_IRQn
#define UARTx_IRQHandler                		USART2_IRQHandler

#define TIMx                         		TIM6
#define TIMx_CLK_ENABLE              		__TIM6_CLK_ENABLE

#define TIMx_RCC_FORCE_RESET              	__HAL_RCC_TIM6_FORCE_RESET
#define TIMx_RCC_RELEASE_RESET             	__HAL_RCC_TIM6_RELEASE_RESET

/* Definition for TIMx's NVIC */
#define TIMx_IRQn                    		TIM6_IRQn
#define TIMx_IRQHandler              			TIM6_IRQHandler


/* Exported constants --------------------------------------------------------*/
extern UART_HandleTypeDef 		UartHandle;
extern TIM_HandleTypeDef    		TIMxHandle;


/* Exported macro ------------------------------------------------------------*/
/* Exported functions ------------------------------------------------------- */

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
